fraserb99/ee579-msp430/Group Project/main.c
#include <msp430.h> 


/**
 * main.c for Group 4
 *
 *
 * based on previous challenges and examples from TI code
 */

//Global variables and constants
//sending messages
/** first row is flag, second is value to send, codes for index:
*   0 = error, 1 = button, 2 = button2, 3 = potentiometer, 4 = temperature
*
*   for error if value is 1 - generic, if value is 2 - no more timers, 3 - clashing rules
*/
int send[2][5] = {{0, 0, 0, 0, 0},
                  {0, 0, 0, 0, 0}};
unsigned int send_message = 0;                  //flag used to indicate that at least one message needs to be sent

/* Description of codes used for the timers, A0_0 is reserved for UART
 * for those with 1 timer:
 * A0_1 = 1, A0_2 = 2, A1_0 = 3, A1_1 = 4, A1_2 = 5
 *
 * For 2 timers
 * A0_1 +          A1_0 +          A1_1 +
 *    A0_2 = 10,      A1_1 = 11,      A1_2 = 13,
 *                    A1_2 = 12,
 *
 */

/**inputs
 * The codes for activation are based on the timers, if value is 0 that means not active, if -1 means disable/deactivate
 */
//button stuff
signed int button = 0;                         //Button variable, depends on timer used
unsigned int b_activated = 0;                   //boolean for denoting button activation
unsigned int timer_count = 0;                    //initial count for the wait time
unsigned int pressed = 0;                       //checking for pressed state, used for debouncing
unsigned int held = 0;                          //checking if the button is being pressed/held
const int debounce_b = 328;                     //count for the 50Hz, based on 32768/(2*x)= 50, want a 20ms wait for the debouncing, 1/20*10^-3 = 50
const int count_b = 820;                        //count for the count for presses, rate of 20Hz, based on 32768/(2x) = 20Hz
int activated_button[];                         //indicator for activated timer for the button

//Button 2 (called switch
signed int button2 = 0;                        //Button 2 variable
unsigned int b2_activated = 0;                  //button 2 activation
unsigned int timer_count2 = 0;                   //initial count for the wait time
unsigned int pressed2 = 0;                      //checking for pressed state, used for debouncing
unsigned int held2 = 0;                         //checking if the button is being pressed/held
const int debounce_b2 = 164;                    //count for the 100Hz, based on 32768/(2*x)= 100, want a 10ms wait for the debouncing, 1/20*10^-3 = 50
const int count_b2 = 820;                       //count for the count for presses, rate of 20Hz, based on 32768/(2x) = 20Hz
int activated_button2[];                        //indicator for activated timer for the button

//potentiometer stuff
signed int pot = 0;                             //Potentiometer use
unsigned int pot_activated = 0;                 //boolean for denoting potentiometer activation
unsigned int orig_val = 0;                      //Setting up value for original potentiometer vale
unsigned int value = 0;                         //value on check
signed int change = 0;                          //value to check how much the pot has changed
const int step_size = 100;                       //value to indicate step size
unsigned int stable_pot = 0;                    //used to check first value after stabilisation timers
unsigned int sample_pot = 0;                    //used to denote if pot should be sampled
const int sample_time = 328;                 //sample every 10ms
int activated_pot[];                            //array used for timer activation and deactivation

//temp stuff
signed int thermometer = 0;                    //thermometer use
unsigned int t_activated = 0;                   //boolean for denoting thermometer activation
signed int orig_temp = 0;                       //Setting up value for original potentiometer vale
signed int value_temp = 0;                      //value on check
unsigned int temp = 0;
signed long change_t = 0;                       //value to check how much the pot has changed
const int step_size_t = 2;                      //value to indicate step size, as error is +- 2 step size is set to 2 for more stable operation
unsigned int stable = 0;                        //boolean for determining if stable Vref
unsigned int sample_temp = 0;                   //boolean to be used to indicate a sample should be taken
const int sample_temp_time = 16384;             //used for sample time of the temperature 16384
int activated_temp[];                           //indicator for activated timer for the temperature

/**Outputs
 * variables and constants for breathing and fading lights, same for all LEDs independent of user defined speeds
 */
signed int max_brightness = 32;                  //used for checking max value for brightness and counter value, based on single light
signed int change_period = 16;                   //period for flashing and breathing, default values, based on single light
const int max_brightness1 = 32;                 //Values used for this, used for 1 blinking light
const int change_period1 = 16;                  //values for the period
const int max_brightness2 = 16;                 //values for more than 1 breathing light
const int change_period2 = 8;                   // >1 breathing light
const int brightness_register_1 = 4096;         //used for brightness increment timing, 1Hz, first setting
const int brightness_register_2 = 2048;         //used for brightness increment timing, 2Hz, second setting
const int brightness_register_3 = 1024;         //used for brightness increment timing, 4Hz, third setting
//LED1 stuff
signed int led1_on = 0;                         //LED D1 on, 0 indicate off, -1 - deactivate
unsigned int led1_active = 0;                   //check if the light has been activated - can only have one setting on at a time
unsigned int led1_fo_active = 0;                //own activation check for fade out as that can turn lights of that are on, if wanted
signed int led1_blink = 0;                     //LED1 blinking light
signed int led1_fade_in = 0;                   //LED1 fade in
signed int led1_fade_out = 0;                  //LED1 fade out
signed int led1_breath = 0;                    //LED1 blinking light
unsigned int blink_rate_1 = 16384;              //rate for the blinking light of LED D1, default period 1Hz
unsigned int light_flag_1 = 0;                  //breathing and fading light flag, brighter or darker,  brighter = 0, darker = 1;
unsigned int brightness_1 = 0;                  // Varies brightness between 0 and 32
unsigned int counter_val_1 = 0;                 //counter for the LED on time
unsigned int period_1 = 2048;                   //overall period for the fading and breathing light, default is 2Hz
int activated_led1[];                           //Array for activated timers for LED D1

