fraserb99/ee579-msp430/Group Project/main.c
    }



	__bis_SR_register(GIE);                     //interrupt enabled

    while(1){
        //read messages here


        //sending messages
        if(send_message){ //there is a message to send
            int i, to_send, value;
            for(i=0; i<5; i++){ //loop through and check for flag

                if(send[0][i] == 1){ //if the flag is set
                    to_send = i;      //say which one to send
                }

                switch(to_send){
                case 0:
                    //send error message here
                    //value = send[1][0]
                    //reset flag
                    send[0][0] = 0;
                    break;
                case 1:
                    //send message for button
                    //value is the time the button has been pressed for
                    //counts every 50ms so multiply by 50, to get total time in ms
                    value = send[1][1]*50;
                    //reset flag
                    send[0][1] = 0;
                    break;
                case 2:
                    //send message for second button, hold time in ms
                    value = send[1][2]*50;
                    send[0][2] = 0;
                    break;
                case 3:
                    //send message for potentiometer
                    //value stored in send[1][3]
                    send[0][3] = 0;
                    break;
                case 4:
                    //send message for temperature, in degrees C
                    //value stored in send[1][4]
                    send[0][4] = 0;
                    break;
                default:
                    //something went wrong
                    break;
                }
            }
            //reset the send message flag
            send_message = 0;
        }


        //inputs
        //check if button was requested
        if (button > 0){
            if (!b_activated){ //if not already activated
                //button set up, from slides and previous challenge
                P1OUT |= BIT3;                            //pull up resistor on P1.3
                P1REN |= BIT3;                            //Enable it
                P1IES |= BIT3;                            //high to low edge
                P1IFG &= ~BIT3;                           // Clear flag
                P1IE |= BIT3;                             //Interrupt enable

                int counts[1] = {debounce_b};
                b_activated = activate_free_timer(1, counts, -1); //activate free timer, needs to be alone
                //record which ones were activated
                activated_button[0] = activated_timers[0];
                button = activated_button[0];                //assign to check properly for timer interrupts
                if (b_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //send error
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic error
                    //disable button
                    button = -1;
                } else {
                        //turn of the timer for now, still being used, just doesnt need to trigger atm
                    switch (button){
                    case 1:
                        TA0CCR1 = 0;
                        break;
                    case 2:
                        TA0CCR2 = 0;
                        break;
                    case 3:
                        TA1CCR0 = 0;
                        break;
                    case 4:
                        TA1CCR1 = 0;
                        break;
                    case 5:
                        TA1CCR2 = 0;
                        break;
                    default:
                        //something went wrong, send error
                        send_message = 1;
                        send[0][0] = 1; //set flag
                        send[1][0] = 1; //generic error
                        button = -1; //disable button as wrong timer used
                        break;
                    }
                }

            }
        } else if(button == -1){
            b_activated = 0;                        //if button is no longer requested
            deactivate_timer(activated_button, 2);   //turn off timer
            P1IE &= ~BIT3;                          //and button interrupt
            P1REN |= BIT3;                          // and disable the pullup/pulldown
            button = 0; //set to default (off)
        }


        //check button 2, same code as button 1 pretty much, just different pins
        //Copied from button 1
        if (button2 > 0){
            if (!b2_activated){ //if not already activated
                P1OUT |= BIT5;                            //pull up resistor on P1.5
                P1REN |= BIT5;                            //Enable it
                P1IES |= BIT5;                            //high to low edge
                P1IFG &= ~BIT5;                           // Clear flag
                P1IE |= BIT5;                             //Interrupt enable

                int counts[1] = {debounce_b2};
                b2_activated = activate_free_timer(1, counts, -1); //single timer, alone
                //record which ones were activated
                activated_button2[0] = activated_timers[0];
                button2 = activated_button2[0];                //assign to check properly for timer interrupts
                if (b2_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //send error
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic error
                    //disable button
                    button2 = -1;
                } else {
                    //turn of the timer for now
                    switch (button2){
                    case 1:
                        TA0CCR1 = 0;
                        break;
                    case 2:
                        TA0CCR2 = 0;
                        break;
                    case 3:
                        TA1CCR0 = 0;
                        break;
                    case 4:
                        TA1CCR1 = 0;
                        break;
                    case 5:
                        TA1CCR2 = 0;
                        break;
                    default:
                        //Something went wrong, send generic error message
                        send_message = 1;
                        send[0][0] = 1; //set flag
                        send[1][0] = 1; //generic error
                        button2 = -1; //disable button
                        break;
                    }
                }
            }

