fraserb99/ee579-msp430/Group Project/main.c
        } else if(button2 == -1){
            b2_activated = 0;                        //if button is no longer requested
            deactivate_timer(activated_button2, 2);   //turn off timer
            P1IE &= ~BIT5;                          //and button interrupt
            P1REN |= BIT5;                          // and disable the pullup/pulldown
            button2 = 0;
        }

        //pot
        //can only run timer or pot
        if (pot > 0){
            if(t_activated) {
                //send error message as both can't be active
                send_message = 1;
                send[0][0] = 1; //set flag
                send[1][0] = 3; //clashing rules
                //disable pot
                pot = -1;
            } else {
                if(!pot_activated){         //if not already activated
                    ADC10CTL0 = ADC10ON + CONSEQ_0 + SREF_0; // ADC10ON, single channel single sample, ref 0
                    ADC10CTL1 = INCH_4 + ADC10SSEL_1;          // input A4, clock = ACLK
                    ADC10AE0 |= BIT4;                          // PA.4 ADC option select

                    int counts[1] = {10}; //stabilisation count
                    pot_activated = activate_free_timer(1, counts, 0); //single timer, doesn't need to be alone
                    activated_pot[0] = activated_timers[0];      //record which ones were activated
                    pot = activated_pot[0];              //Set for proper check in interrupts
                    if (pot_activated != 1) { //if return is 1, has now been activated
                        //something went wrong
                        send_message = 1;
                        send[0][0] = 1; //set flag
                        send[1][0] = 1; //generic
                        //disable pot
                        pot = -1;
                    } else {
                        stable_pot = 0;
                        sample_pot = 0;
                    }
                } else {
                    if(sample_pot) {
                        //TODO: remove comments if the code can work with temp
                        //ADC10CTL0 |= SREF_0;                    //set ref to 0
                        //ADC10CTL1 |= INCH_4;                     //Ensure right channel

                        ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                        //ADC10AE0 |= BIT4;                          // PA.4 ADC option select
                        //ADC10MEM = conversion result
                        //wait for result completion, triggers interrupt when done, ADC10Iflag
                        while ((ADC10CTL1 & ADC10BUSY) == 1) {//check if busy
                            //Wait for sample to take place
                        }
                        value = ADC10MEM;           //Just to make sure the value doesn't change during checking
                        //reset ENC
                        //ADC10CTL0 &= ~ENC;

                        if(value != orig_val){ //if value has changed
                            //check by how much
                            change = abs(orig_val - value);

                            if (change >= step_size){
                                //send message
                                send_message = 1;
                                send[0][3] = 1; //set flag
                                send[1][3] = value; //value of pot

                                //change to new orig value
                                orig_val = value;
                                //testing light
                                P1OUT ^= BIT6;
                            }

                        }
                        sample_pot = 0;
                    }
                }
            }

            //Code here for the potentiometer, so basically send stuff at interval checks
        } else if(pot == -1){
            deactivate_timer(activated_pot, 1);
            pot_activated = 0;
            pot = 0;
        }

        //check if thermometer was requested
        if(thermometer > 0){
            //check for pot first
            if(pot_activated){
                //send error
                send_message = 1;
                send[0][0] = 1; //set flag
                send[1][0] = 3; //clashing rules
                //Disable temp
                thermometer = -1;
            } else{
                //based on example adc10_temp.c from URL: http://dev.ti.com/tirex/explore/node?node=AEldOKIXgnT979MckUlLRw__IOGqZri__LATEST
                if(!t_activated){
                    ADC10CTL0 = ADC10ON + SREF_1 + REFON; // ADC10ON, vr+ = Vref+f, Vr- = Vss, reference on, ref 1
                    ADC10CTL1 = INCH_10 + ADC10SSEL_1;    // temp sensor, clock = ACLK
                    ADC10AE0 |= BIT1;                     // PA.1 ADC option select

                    //set up a timer for stabilisation, use A1
                    //need a 30microsecond delay calculation time was 0.49, putting 10 to test, need only 1 timer
                    int counts[1] = {10};
                    t_activated = activate_free_timer(1, counts, 0); //single timer, doesn't need to be alone
                    activated_temp[0] = activated_timers[0];      //record which ones were activated
                    thermometer = activated_temp[0];              //Set for proper check in interrupts
                    if (t_activated != 1) { //if return is 1, has now been activated
                        //something went wrong
                        send_message = 1;
                        send[0][0] = 1; //set flag
                        send[1][0] = 1; //generic
                        //disable temp
                        thermometer = -1;
                    } else {
                        stable = 0;
                    }
                }

                if (sample_temp){
                    //TODO: remove comments to test with pot
                    //ADC10CTL0 = SREF_1
                    //ADC10CTL1 = INCH_10
                    //ADC10AE0 |= BIT1;
                    ADC10CTL0 |= ENC + ADC10SC;         // Sampling and conversion start
                    //based on code for pot above
                    //ADC10MEM = conversion result
                    while ((ADC10CTL1 & ADC10BUSY) == 1) {//check if busy
                        //Wait for sample to take place
                    }
                    temp = ADC10MEM;           //Just to make sure the value doesn't change during checking
                    //reset ENC
                    ADC10CTL0 &= ~ENC;
                    value_temp = ((temp - 673) * 423) / 1024;

                    if(value_temp != orig_temp){ //if value has changed
                        //check by how much
                        change_t = abs(orig_temp - value_temp);

