fraserb99/ee579-msp430/Group Project/main.c
        } else if(led3_on == -1){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_active = 0;                    //not active anymore
            led3_on = 0;
        }

        //circling
        if(led3_rot > 0){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_rot = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the rotation light
                    led3_rot = -1;
                } else {
                    //toggle LED D3, wanted colour
                    P2OUT = colours[colour];
                }
            }

        } else if(led3_rot == -1){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_rot = 0;

        }

        //blinking
        if(led3_blink > 0){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_blink = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the blinking light
                    led3_blink = -1;
                } else {
                    //toggle LED D3, with start colour
                    P2OUT = colours[colour];
                    //indicate on
                    led3_blink_on = 1;
                }

            }

        } else if(led3_blink == -1){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_blink = 0;
        }

        //fade in
        if(led3_fade_in > 0){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                P2OUT &= ~(BIT1 + BIT3 + BIT5); //don't want it on
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_3};
                led3_active = activate_free_timer(2, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated, first
                activated_led3[1] = activated_timers[1]; //record second one
                led3_fade_in = get_timer_code(activated_led3);
                if (led3_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable fade in
                    led3_fade_in = -1;
                } else {
                    light_flag_3 = 0;
                    counter_val_3 = 0;
                }
            }

        } else if (led3_fade_in == -1){
            deactivate_timer(activated_led3, 2);
            led3_fade_in = 0;
        }

        //fade out
        if(led3_fade_out > 0){
            if(!led3_fo_active){ //if light hasn't been activated, or if on
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_3};
                led3_fo_active = activate_free_timer(2, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated, first
                activated_led3[1] = activated_timers[1]; //record second one
                led3_fade_out = get_timer_code(activated_led3);
                if (led3_fo_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable fade out
                    led3_fade_out = -1;
                } else {
                    led3_active = 1; //led is being used
                    //for testing
                    //P1OUT ^= BIT6;
                    //set the brightness to max
                    brightness_3 = max_brightness;
                    light_flag_3 = 1;
                    counter_val_3 = 0;
                    //need to turn on a light first, if not already on, on the specified colour
                    P2OUT |= colours[colour];
                }

            }

        } else if (led3_fade_out == -1){
            led3_fo_active = 0;
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);
            deactivate_timer(activated_led3, 2);
            led3_fade_out = 0;
        }

        //breathing
        if(led3_breath > 0){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                check_breath();
                //need 2 timers for the breathing light
                int counts[2] = {change_period, period_3};
                led3_active = activate_free_timer(2, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated, first
                activated_led3[1] = activated_timers[1]; //record second one
                led3_breath = get_timer_code(activated_led3);
                if (led3_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the breathing light
                    led3_breath = -1;
                } else {
                    light_flag_3 = 0;
                    counter_val_3 = 0;
                    lights_used[2] = 1;
                }
            }

