fraserb99/ee579-msp430/Group Project/main.c
        } else if (led3_breath == -1){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5); //turn off the light
            deactivate_timer(activated_led3, 2);
            led3_breath = 0;
            lights_used[2] = 0;
        }

        //Buzzer for specified duration
        if(buzzer_tone > 0){
            if(!buzzer_active){ //if it's not been activated
                //activate the pins used
                P2DIR |= BIT2 + BIT4;
                P2OUT |= BIT2;     //ensure one is on, the other off
                P2OUT &= ~ BIT4;
                buzzer_count = 0;   //ensure this is at 0;
                buzzer_duration = buzzer_duration/5; //ensure duration is proper
                //need to have 1 timer
                int counts[1] = {buzzer_period};
                buzzer_active = activate_free_timer(1, counts, 0);
                activated_buzzer[0] = activated_timers[0]; //record which one were activated
                buzzer_tone = activated_buzzer[0]; //get the timer
                if (buzzer_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the buzzer
                    buzzer_tone = -1;
                }
            }
        } else if (buzzer_tone == -1){
            buzzer_active = 0;  //no longer on
            P2OUT &= ~BIT2;
            P2OUT &= ~BIT4;
            deactivate_timer(activated_buzzer, 1);
            buzzer_tone = 0;
        }

        //Buzzer beeping
        if(buzzer_beep > 0){
            if(!buzzer_active){ //if it's not been activated
                //activate the pins used
                P2DIR |= BIT2 + BIT4;
                P2OUT |= BIT2;     //ensure one is on, the other off
                P2OUT &= ~ BIT4;
                buzzer_count = 0;   //ensure this is at 0;
                buzzer_duration = buzzer_duration/5; //ensure duration is proper
                buzzer_duration_off = buzzer_duration_off/5; //ensure duration is proper
                //need to have 1 timer
                int counts[1] = {buzzer_period};
                buzzer_active = activate_free_timer(1, counts, 0);
                activated_buzzer[0] = activated_timers[0]; //record which one were activated
                buzzer_beep = activated_buzzer[0];
                if (buzzer_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the buzzer
                    buzzer_beep = -1;
                }
            }

        } else if (buzzer_beep == -1){
            buzzer_active = 0;  //no longer on
            P2OUT &= ~BIT2;
            P2OUT &= ~BIT4;
            deactivate_timer(activated_buzzer, 1);
            buzzer_beep= 0;
        }

    }
}

/**interrupts,
 * duplicated code to allow for optimum timer usage
 *
 * timer A0 is reserved for UART
 */

#pragma vector=TIMER0_A0_VECTOR
__interrupt void Timer0_A0 (void)
{
    //TODO: insert uart code here
    //UART stuff here, generic timer nr for now
    TA0CCR0 += 16384;
}

//interrupt for timer A0_1,2 and overflow
#pragma vector=TIMER0_A1_VECTOR
__interrupt void Timer0_A1(void){
    switch(TA0IV)
    {
    case  2:
        //check for how long button was pressed
        if ((button == 1) && (held == 1)) {
            if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
                timer_count += 1;
                //offset TA0CCR1 by the count number/period
                TA0CCR1 += count_b;
            } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
                //send message for how long the button was held for
                send_message = 1;
                send[0][1] = 1; //set flag
                send[1][1] = timer_count; //the time held

                //testing with light first
                //P1OUT ^= BIT0;
                //led2_breath = 1;
                led1_fade_out = 1;
                //buzzer_beep = -1;
                held = 0;                               //button has now been released
                //set timer count to 0
                TA0CCR1 = 0;
            }

        } else if (button == 1){ //check that it is the button debouncing
            if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
                 timer_count = 0;                     //Reset the timer count
                 pressed = 0;                        //reset pressed
                 held = 1;                           //Button is being held
                 //P1OUT ^= BIT6;
                 //offset TA0CCR0 by the count number/period
                 //change the value held in the array
                 timers_used[0][1] = count_b;
                 TA0CCR1 += count_b;

            } else {
                pressed = 0;                         //Button is not being pressed
            }

         }

        //button 2, copied code
        if ((button2 == 1) && (held2 == 1)) {
            if ((held2 == 1) && !(P1IN & BIT5)) { //check how long its being held for
                timer_count2 += 1;
                //offset TA0CCR1 by the count number/period
                TA0CCR1 += count_b2;
            } else if ((held2 == 1) && (P1IN & BIT5)){   //if button was released
                //send message for how long the button was held for
                send_message = 1;
                send[0][1] = 1; //set flag
                send[1][1] = timer_count2; //the time held
                //testing with light first
                //P1OUT ^= BIT0;
                buzzer_beep = -1;
                held2 = 0;                               //button has now been released
                TA0CCR1 = 0;
            }

