fraserb99/ee579-msp430/Group Project/main.c
        //fade out part 2
        if((led3_fade_out == 12) || (led3_fade_out == 13)) {
            if(light_flag_3 == 1) {
                brightness_3 -= 1;                //decrease brightness
            }

             if(brightness_3 == 0) {       //reached lowest value
                P2OUT &= ~(BIT1 + BIT3 + BIT5); //keep light off
                led3_fade_out = -1;          //completed task, deactivate it
            }

            TA1CCR2 += period_3;
        }

        //breathing part 2
        if((led3_breath == 12) || (led3_breath == 13)){
            if(light_flag_3 == 0){
                brightness_3 += 1;                //increase brightness
            } else {
                brightness_3 -= 1;                //decrease brightness
            }

            if(brightness_3 == max_brightness){               //if max brightness
                light_flag_3 = 1;                //set to decrease
            } else if (brightness_3 == 0) {       //reached lowest value
                light_flag_3 = 0;                //increase light
                //change colour
                //verify boundaries
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 5;
                } else if ((colour == 5) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
            }

            TA1CCR2 += period_3;
        }

        //buzzer
        if(buzzer_tone == 5){
            buzzer_count += 1;  //increment count
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_tone = -1; //turn it off
            }

            TA1CCR2 += buzzer_period;
        }

        //buzzer beeping
        if(buzzer_beep == 5){
            buzzer_count += 1;  //increment count

            if(buzzer_on) { //if it is on, alternate
                //alternate the pins
                P2OUT ^= BIT2;
                P2OUT ^= BIT4;
                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration){
                    buzzer_on = 0; //turn off
                    buzzer_count = 0; //reset count
                }

            } else { //if off, turn both off
                P2OUT &= ~BIT2;
                P2OUT &= ~BIT4;

                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration_off){
                    buzzer_on= 1; //turn it on
                    //buzzer count reset
                    buzzer_count = 0;
                    //turn one of them on
                    P2OUT |= BIT2;
                }

            }


            TA1CCR2 += buzzer_period;
        }
        break;


    case 10: break;                             //Timer_A3 overflow, don't need to do anything

    }

}

//Interrupt for the button, based on the slides/previous task
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void){
    //if it was the button that was pressed
    if(P1IFG & BIT3){
        pressed = 1;                            //Turn on flag for debouncer/check if button was pressed properly
        //debouncer timer, based on current count, check which one was used
        switch(button){//Current count plus the wanted debounce part
        case 1:
            TA0CCR1 = TAR + debounce_b;
            break;
        case 2:
            TA0CCR2 = TAR + debounce_b;
            break;
        case 3:
            TA1CCR0 = TAR + debounce_b;
            break;
        case 4:
            TA1CCR1 = TAR + debounce_b;
            break;
        case 5:
            TA1CCR2 = TAR + debounce_b;
            break;
        }

        P1IFG &= ~BIT3;                             //clear flag
    } else if(P1IFG & BIT5){ //if it was button 2
        pressed2 = 1;
        //debouncer timer, based on current count, check which one was used
        switch(button2){
        case 1:
            TA0CCR1 = TAR + debounce_b2;
            break;
        case 2:
            TA0CCR2 = TAR + debounce_b2;
            break;
        case 3:
            TA1CCR0 = TAR + debounce_b2;
            break;
        case 4:
            TA1CCR1 = TAR + debounce_b2;
            break;
        case 5:
            TA1CCR2 = TAR + debounce_b2;
            break;
        }
        P1IFG &= ~BIT5;                             //clear flag
    }


}


//Helper functions
//function for activating a specific timer
int activate_timer(int timer_no, int count){
    if(timer_no == 0){
        TA0CTL = TASSEL_1 + MC_2 + TAIE;          // ACLK, continuous mode, interrupt enabled
        TA0CCTL0 |= CCIE;                         // TA0CCR0 interrupt enabled
        TA0CCR0 = count;

        timers_used[0][0] = count;
        timers_used[1][0] = 1;
        timer0_activated = 1;
        return 1;
    } else if (timer_no == 1){
        TA1CTL = TASSEL_1 + MC_2 + TAIE;          // ACLK, continuous mode, interrupt enabled
        TA1CCTL0 |= CCIE;

        TA1CCR0 = count;
        timers_used[0][3] = count;
        timers_used[1][3] = 1;

        timer1_activated = 1;
        return 1;
    }

    return 0;

}

///fix this
//function for checking which timer is free, if alone is 1 then the timer needs to be on its own
int activate_free_timer(int registers, int counts[], int alone){
    //check which registers are free, if less than the register amount, return error
    int potential[2] = {}; //potential registers, second row is the value held in the register
    int to_activate[2] = {0, 0}; //registers to activate
    unsigned int index = 0;
    unsigned int i, r;

    //check how many registers there are, currently max is 2
    if(registers == 1) {
        //loop through and look first for registers with the same counts, unless the timer should be alone
        if(alone) {
            for(i=0; i<5; i++){
                if(timers_used[0][i] == 0){
                   to_activate[0] = i;
                   index = 1; //found one
                   break; //no need to look for others
               }
            }

            //check that one was actually found
            if(index == 0) {
                //error
                return 0;
            } //else its fine, just continue
        } else { //can look for evidence of same register value, if free
            for(i=0; i<5; i++){
                //check that the timer is available for others
               if((timers_used[0][i] == counts[0]) && (timers_used[1][i] != -1)){
                  to_activate[0] = 1;
                  index = 1;
                  break; //break out as one was found
               }
            }
            //if none was found, check for free ones
            if(index == 0) {
                for(i=0; i<5; i++){
                    //check for first free timer
                   if(timers_used[0][i] == 0){
                      to_activate[0] = 1;
                      index = 1;
                      break; //break out as one was found
                   }
                }
            }
            //check that one was actually found, otherwise return 0
            if(index == 0){
                return 0;
            }
        }

    } else if (registers == 2){ //shouldn't have any that needs to be alone
        //check registers for ones with same period
        for(r=0; r<2; r++){
            for(i=0; i<5; i++){
                //check that the timer is available for others
               if((timers_used[0][i] == counts[r]) && (timers_used[1][i] != -1)){
                   if(r == 0){ //if first register
                       //need to verify that it is either 1, 3, or 4
                       if((i == 1) || (i == 3) || (i == 4)){
                           potential[0] = i;
                           index++;
                           break; //break out as one was found
                       } //if not invalid option
                   } else {
                       //need to verify that it is either 2, 4, or 5
                      if((i == 2) || (i == 4) || (i == 5)){
                          potential[1] = i;
                          index++;
                          break; //break out as one was found
                      } //if not invalid option
                   }
               }
            }
            //if none were found check for free one
            if(r == 0) {
                if(index == 0){
                    for(i=0; i<5; i++){
                       if(timers_used[0][i] == 0){
                           if((i == 1) || (i == 3) || (i == 4)){
                              potential[0] = i;
                              index++;
                              break; //break out as one was found
                          } //if not, invalid option
                       }
                    }
                }
            } else {
                if(index == 1){
                    for(i=0; i<5; i++){
                       if(timers_used[0][i] == 0){
                           //also need to check what the first potential one
                           if(potential[0] == 1){
                               if(i == 2){
                                   potential[1] = i;
                                   index++;
                                   break; //break out as one was found
                               }
                           } else if(potential[0] == 3){
                               if((i == 4) || (i == 5)){
                                   potential[1] = i;
                                   index++;
                                   break; //break out as one was found
                               }

